spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
#include <stdint.h>
#include <cstring>
#include <cmath>

#include "bsp.hpp"
#include "error.hpp"
#include "debug.hpp"
#include "gpio.hpp"
#include "scheduler.hpp"
#include "timer.hpp"
#include "binascii.hpp"
#include "smd_sat.hpp"
#include "pmu.hpp"

#include "nrf_delay.h"
#include "nrf_gpio.h"

extern Scheduler *system_scheduler;
extern Timer *system_timer;

// ============================================================================
// Constructor / Destructor
// ============================================================================

SmdSat::SmdSat(SmdSatCmd& cmd, unsigned int idle_shutdown_ms)
	: m_cmd(cmd)
{
	DEBUG_TRACE("SmdSat::%s",__func__);
	set_idle_timeout(idle_shutdown_ms);
	m_packet_buffer.clear();
	m_modulation = ARGOS_MOD_LDA2;
	m_state = SmdSatState::stopped;
	m_tcxo_warmup_time = DEFAULT_TCXO_WARMUP_TIME_SECONDS;
	m_tx_power = 0;
	this->shutdown();
	is_kmac_profil_loaded = false;
}

SmdSat::~SmdSat() {
	power_off_immediate();
}

// ============================================================================
// Power management
// ============================================================================

void SmdSat::shutdown(void) {
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(SMDSAT_DELAY_RST_MS);
	GPIOPins::clear(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
}

void SmdSat::power_off() {
	DEBUG_TRACE("SmdSat::%s",__func__);
	if (!SMD_STATE_EQUAL(stopped)) {
		m_stopping = true;
	}
}

void SmdSat::power_on() {
	DEBUG_TRACE("SmdSat::%s",__func__);

	if (m_state != SmdSat::stopped) {
		m_stopping = false;
		DEBUG_TRACE("SmdSat::%s:: already running",__func__);
		return;
	}

	m_stopping = false;
	SMD_STATE_CHANGE(stopped, starting);
	DEBUG_TRACE("SmdSat::%s:: start state machine",__func__);
	state_machine();
}

void SmdSat::power_off_immediate()
{
	DEBUG_TRACE("SmdSat::%s",__func__);

	if (!SMD_STATE_EQUAL(stopped)) {
		system_scheduler->cancel_task(m_task);
		switch (m_state) {
		case SmdSatState::starting:         state_starting_exit(); break;
		case SmdSatState::powering_on:      state_powering_on_exit(); break;
		case SmdSatState::load_kmac:        state_load_kmac_exit(); break;
		case SmdSatState::idle_pending:     state_idle_pending_exit(); break;
		case SmdSatState::idle:             state_idle_exit(); break;
		case SmdSatState::transmit_pending: state_transmit_pending_exit(); break;
		case SmdSatState::transmitting:     state_transmitting_exit(); break;
		case SmdSatState::error:            state_error_exit(); break;
		case SmdSatState::stopped:          break;
		default: break;
		}
		m_state = SmdSatState::stopped;
		state_stopped_enter();
	}

	// Clean up transport in case state was already stopped
	m_cmd.deinit();
}

// ============================================================================
// State machine
// ============================================================================

void SmdSat::state_machine(bool use_scheduler) {
	m_next_delay = 0;

	switch (m_state) {
	case SmdSat::starting:
		SMD_STATE_CALL(starting);
		break;
	case SmdSat::powering_on:
		SMD_STATE_CALL(powering_on);
		break;
	case SmdSat::load_kmac:
		SMD_STATE_CALL(load_kmac);
		break;
	case SmdSat::idle_pending:
		SMD_STATE_CALL(idle_pending);
		break;
	case SmdSat::idle:
		SMD_STATE_CALL(idle);
		break;
	case SmdSat::transmit_pending:
		SMD_STATE_CALL(transmit_pending);
		break;
	case SmdSat::transmitting:
		SMD_STATE_CALL(transmitting);
		break;
	case SmdSat::error:
		SMD_STATE_CALL(error);
		break;
	case SmdSat::stopped:
		SMD_STATE_CALL(stopped);
		break;
	default:
		break;
	}

	if (use_scheduler && !SMD_STATE_EQUAL(stopped)) {
		system_scheduler->cancel_task(m_task);
		m_task = system_scheduler->post_task_prio([this]() {
			state_machine();
		}, "SmdReceiverStateMachine", Scheduler::DEFAULT_PRIORITY, m_next_delay);
	}
}

void SmdSat::state_starting_enter() {}
void SmdSat::state_starting_exit() {}

void SmdSat::state_starting()
{
	m_is_first_tx = true;
	is_kmac_profil_loaded = false;
	m_cmd.init();
	m_state_counter = 3;
	m_next_delay = 0;
	SMD_STATE_CHANGE(starting, powering_on);
}

void SmdSat::state_error_enter() {
	try {
		uint8_t status = 0;
		m_cmd.get_kmac_status(&status);
	} catch (...) {
		DEBUG_WARN("SmdSat::%s: read failed in error handler", __func__);
	}
	notify(KineisEventDeviceError({}));
	SMD_STATE_CHANGE(error, stopped);
}

void SmdSat::state_error_exit() {}

void SmdSat::state_error() {
	SMD_STATE_CHANGE(error, stopped);
}

void SmdSat::state_stopped_enter() {
	m_cmd.deinit();

	this->shutdown();
	GPIOPins::release_sensors_pwr();
	nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	is_kmac_profil_loaded = false;

	m_packet_buffer.clear();

	notify(KineisEventPowerOff({}));
}

void SmdSat::state_stopped_exit() {}
void SmdSat::state_stopped() {}

void SmdSat::state_powering_on_enter() {}

void SmdSat::state_powering_on_exit() {
	m_next_delay = SMDSAT_DELAY_POWER_ON_MS;
}

void SmdSat::state_powering_on() {
	DEBUG_TRACE("SmdSat::%s: Starting power-on sequence", __func__);

	GPIOPins::acquire_sensors_pwr();

	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(10);

	GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
	DEBUG_TRACE("SmdSat::%s: Power enabled | waiting for stabilization", __func__);

	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	GPIOPins::release_to_highz(SAT_RESET);
	DEBUG_TRACE("SmdSat::%s: Reset released", __func__);

	SMD_STATE_CHANGE(powering_on, idle_pending);
}

void SmdSat::state_load_kmac_enter() {}
void SmdSat::state_load_kmac_exit() {}

void SmdSat::state_load_kmac() {
	uint8_t kmac_status = 0;
	m_cmd.get_kmac_status(&kmac_status);
	if (kmac_status == MAC_OK) {
		if (!is_kmac_profil_loaded) {
			m_cmd.load_kmac_profil(1);
			m_next_delay = SMDSAT_DELAY_LOAD_KMAC_MS;
			is_kmac_profil_loaded = true;
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
		}
		SMD_STATE_CHANGE(load_kmac, idle_pending);
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: failed to enter load kmac state",__func__);
			SMD_STATE_CHANGE(load_kmac, error);
		} else {
			m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		}
	}
}

void SmdSat::state_idle_pending_enter() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
	m_state_counter = 10;
}

