spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_idle_pending_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
}

void SmdSat::state_idle_pending() {
	if (m_cmd.ping()) {
		if (!is_kmac_profil_loaded) {
			SMD_STATE_CHANGE(idle_pending, load_kmac);
		} else {
			SMD_STATE_CHANGE(idle_pending, idle);
		}
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: failed to enter IDLE state",__func__);
			SMD_STATE_CHANGE(idle_pending, error);
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
		}
	}
}

void SmdSat::state_idle_enter() {
	m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
}

void SmdSat::state_idle_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
}

void SmdSat::state_idle() {
	if (m_packet_buffer.length()) {
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		SMD_STATE_CHANGE(idle, transmit_pending);
	} else if (m_stopping) {
		SMD_STATE_CHANGE(idle, stopped);
	} else {
		m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		if (--m_state_counter == 0) {
			DEBUG_TRACE("SmdSat::%s: idle timeout elapsed",__func__);
			SMD_STATE_CHANGE(idle, stopped);
		}
		return;
	}

	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
}

void SmdSat::state_transmit_pending_enter() {
	m_state_counter = 3;
}

void SmdSat::state_transmit_pending_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_TX + (m_tcxo_warmup_time*1000);
}

void SmdSat::state_transmit_pending() {
	if (m_tx_buffer.size()) {
		if (!m_cmd.initiate_tx(m_tx_buffer)) {
			DEBUG_ERROR("SmdSat::%s: initiate_tx failed, aborting TX", __func__);
			m_tx_buffer.clear();
			SMD_STATE_CHANGE(transmit_pending, error);
			return;
		}
		notify(KineisEventTxStarted({}));
		SMD_STATE_CHANGE(transmit_pending, transmitting);
	} else if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed accept SEND command",__func__);
		SMD_STATE_CHANGE(transmit_pending, error);
	} else {
		m_next_delay = SMDSAT_DELAY_CMD_MS;
	}
}

void SmdSat::state_transmitting_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint32_t total_timeout_ms = (m_tcxo_warmup_time * 1000) + 5000;
	m_state_counter = (total_timeout_ms / SMDSAT_TIMING_POLL_MS) + 1;
	DEBUG_TRACE("SmdSat::%s: poll timeout=%ums | counter=%u", __func__, total_timeout_ms, m_state_counter);
}

void SmdSat::state_transmitting_exit() {
	m_is_first_tx = false;
}

void SmdSat::state_transmitting() {
	if (m_cmd.is_tx_finished()) {
		if (m_tx_buffer.size()) {
			m_tx_buffer.clear();
			DEBUG_INFO("SmdSat::%s: notify KineisEventTxComplete", __func__);
			notify(KineisEventTxComplete({}));
		}
		SMD_STATE_CHANGE(transmitting, stopped);
	} else {
		if (!m_tx_buffer.size()) {
			SMD_STATE_CHANGE(transmitting, stopped);
		} else if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: TX timeout after polling",__func__);
			SMD_STATE_CHANGE(transmitting, error);
		} else {
			m_next_delay = SMDSAT_TIMING_POLL_MS;
		}
	}
}

// ============================================================================
// KineisDevice interface
// ============================================================================

void SmdSat::stop_send() {
	DEBUG_TRACE("SmdSat::%s",__func__);
	m_packet_buffer.clear();
	m_tx_buffer.clear();
}

void SmdSat::start_receive(const KineisModulation mode) {
	(void)mode;
	DEBUG_TRACE("SmdSat::%s: Not supported",__func__);
}

bool SmdSat::stop_receive() {
	DEBUG_TRACE("SmdSat::%s: Not supported",__func__);
	return false;
}

void SmdSat::set_frequency(double freq_mhz) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	m_tx_freq = freq_mhz;
}

void SmdSat::send(const KineisModulation mode, const KineisPacket& user_payload, const unsigned int payload_length)
{
	DEBUG_TRACE("SmdSat::%s: length %u mode=%d current=%d", __func__, payload_length, (int)mode, (int)m_modulation);
	SmdArgosModulation requested = kineis_to_smd_mod(mode);
	if (requested != m_modulation) {
		DEBUG_WARN("SmdSat::%s: TX mode %d != current modulation %d — call switch_modulation() first",
		           __func__, (int)requested, (int)m_modulation);
	}

	unsigned int max_payload_size = 0;
	switch(m_modulation) {
		case ARGOS_MOD_LDA2:
			max_payload_size = ARGOS_TX_LDA2_PAYLOAD_BYTE_SIZE;
			break;
		case ARGOS_MOD_LDK:
			max_payload_size = ARGOS_TX_LDK_PAYLOAD_BYTE_SIZE;
			break;
		case ARGOS_MOD_VLDA4:
			max_payload_size = ARGOS_TX_VLDA4_PAYLOAD_BYTE_SIZE;
			break;
		default:
			DEBUG_TRACE("SmdSat::%s: Unknown modulation type %d", __func__, m_modulation);
			return;
	}

	unsigned int effective_payload_length = std::min(payload_length,
	                                                 static_cast<unsigned int>(user_payload.size()));
	if (effective_payload_length > max_payload_size) {
		DEBUG_ERROR("SmdSat::%s: Payload truncated from %u to %u bytes",
		            __func__, effective_payload_length, max_payload_size);
		effective_payload_length = max_payload_size;
	}

	unsigned int padded_size = max_payload_size;
	if (m_modulation == ARGOS_MOD_LDA2) {
		padded_size = ((effective_payload_length + ARGOS_TX_LDA2_SIZE_STEP - 1) /
		                ARGOS_TX_LDA2_SIZE_STEP) * ARGOS_TX_LDA2_SIZE_STEP;
		if (padded_size < ARGOS_TX_LDA2_MIN_BYTE_SIZE)
			padded_size = ARGOS_TX_LDA2_MIN_BYTE_SIZE;
		if (padded_size > max_payload_size)
			padded_size = max_payload_size;
		DEBUG_TRACE("SmdSat::%s: LDA2 padded %u -> %u bytes", __func__, effective_payload_length, padded_size);
	}

	m_packet_buffer.assign(padded_size, 0);
	std::copy(user_payload.begin(), user_payload.begin() + effective_payload_length, m_packet_buffer.begin());

	DEBUG_TRACE("SmdSat::%s: raw data[%u]=%s", __func__,
	            effective_payload_length,
	            Binascii::hexlify(m_packet_buffer).c_str());

	DEBUG_TRACE("SmdSat::%s::Packet size %u", __func__, static_cast<unsigned int>(m_packet_buffer.size()));

	power_on();
}

void SmdSat::set_tcxo_warmup_time(unsigned int time_s) {
	m_tcxo_warmup_time = time_s;
}

void SmdSat::set_tx_power(unsigned int power) {
	m_tx_power = power;
}

// ============================================================================
// Credentials
// ============================================================================

void SmdSat::set_credentials(unsigned int dec_id, unsigned int address, const std::string& seckey, const std::string& radioconf) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	bool was_stopped = (m_state == SmdSatState::stopped);

