spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
static KineisModulation smd_to_kineis_mod(SmdArgosModulation mode) {
	switch (mode) {
		case ARGOS_MOD_LDK:  return KineisModulation::LDK;
		case ARGOS_MOD_VLDA4: return KineisModulation::VLDA4;
		case ARGOS_MOD_LDA2:
		default:              return KineisModulation::LDA2;
	}
}

bool SmdSat::switch_modulation(KineisModulation mode, const std::string& rconf_hex) {
	SmdArgosModulation target = kineis_to_smd_mod(mode);
	if (target == m_modulation) {
		DEBUG_TRACE("SmdSat::%s: already in target modulation %d", __func__, (int)target);
		return true;
	}

	DEBUG_INFO("SmdSat::%s: switching %d -> %d", __func__, (int)m_modulation, (int)target);

	if (rconf_hex.size() != 32) {
		DEBUG_ERROR("SmdSat::%s: invalid RCONF hex length %u (expected 32)", __func__, (unsigned)rconf_hex.size());
		return false;
	}

	// SMD must be powered on (not stopped) for RCONF write
	bool was_stopped = (m_state == SmdSatState::stopped);
	if (was_stopped) {
		DEBUG_ERROR("SmdSat::%s: SMD is stopped, cannot switch modulation", __func__);
		return false;
	}

	auto wait_cmd = []() { nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2); };

	// 1. Write RCONF
	std::string rconf_bin = Binascii::unhexlify(rconf_hex);
	smd_uint8_array_t rconf_struct = {static_cast<uint16_t>(rconf_bin.size()),
	                                  reinterpret_cast<uint8_t *>(rconf_bin.data())};
	try {
		m_cmd.set_radio_conf(&rconf_struct);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to write RCONF", __func__);
		return false;
	}

	wait_cmd();

	// 2. Save RCONF to flash
	try {
		if (!m_cmd.save_radio_conf()) {
			DEBUG_ERROR("SmdSat::%s: failed to save RCONF", __func__);
			return false;
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: save_radio_conf exception", __func__);
		return false;
	}

	wait_cmd();

	// 3. Reload KMAC profile 1
	try {
		m_cmd.load_kmac_profil(1);
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: failed to reload KMAC", __func__);
		return false;
	}

	wait_cmd();

	// Update cached modulation
	m_modulation = target;
	is_kmac_profil_loaded = true;

	DEBUG_INFO("SmdSat::%s: modulation switched to %d OK", __func__, (int)target);
	return true;
}

KineisModulation SmdSat::get_current_modulation() const {
	return smd_to_kineis_mod(m_modulation);
}

// ============================================================================
// DFU (delegates to command layer)
// ============================================================================

bool SmdSat::dfu_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		PMU::kick_watchdog();
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		PMU::kick_watchdog();
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	m_cmd.init();

	PMU::kick_watchdog();
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);

	bool result = m_cmd.dfu_enter();

	if (!result) {
		if (was_stopped) {
			m_cmd.deinit();
			shutdown();
			GPIOPins::release_sensors_pwr();
			nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
		}
	}

	return result;
}

bool SmdSat::dfu_exit() {
	return m_cmd.dfu_exit();
}

bool SmdSat::dfu_get_bootloader_info(SmdDfuInfo *info) {
	return m_cmd.dfu_get_bootloader_info(info);
}

SmdDfuResponse SmdSat::firmware_update(const uint8_t *firmware, size_t size,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting firmware update | size=%u bytes", __func__, (unsigned int)size);

	if (firmware == nullptr || size == 0) {
		DEBUG_ERROR("SmdSat::%s: Invalid firmware data", __func__);
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	if (!m_cmd.dfu_supported()) {
		DEBUG_ERROR("SmdSat::%s: DFU not supported by command layer", __func__);
		return DFU_RSP_ERROR;
	}

	// Enter DFU mode
	if (!dfu_enter()) {
		DEBUG_ERROR("SmdSat::%s: Failed to enter DFU mode", __func__);
		return DFU_RSP_NOT_READY;
	}

	if (progress_callback) progress_callback(5);

	// Get bootloader info
	SmdDfuInfo dfu_info;
	if (!m_cmd.dfu_get_bootloader_info(&dfu_info)) {
		DEBUG_ERROR("SmdSat::%s: Failed to get bootloader info", __func__);
		return DFU_RSP_ERROR;
	}

	if (size > dfu_info.app_max_size) {
		DEBUG_ERROR("SmdSat::%s: Firmware too large (%u > %u)", __func__,
		            (unsigned int)size, dfu_info.app_max_size);
		return DFU_RSP_SIZE_ERROR;
	}

	if (progress_callback) progress_callback(15);

	// Erase
	result = m_cmd.dfu_erase();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Flash erase failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(25);

	// Write in chunks
	uint32_t addr = dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : (uint16_t)remaining;

		PMU::kick_watchdog();

		result = m_cmd.dfu_write_chunk(addr, &firmware[offset], chunk_size);
		if (result != DFU_RSP_OK) {
			DEBUG_ERROR("SmdSat::%s: Write failed at offset %u", __func__, (unsigned int)offset);
			return result;
		}

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		if (progress_callback) {
			uint8_t progress = 25 + (uint8_t)((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

		nrf_delay_ms(5);
	}

	if (progress_callback) progress_callback(90);

	// Verify CRC32
	PMU::kick_watchdog();
	uint32_t crc = m_cmd.calculate_crc32(firmware, size);
	result = m_cmd.dfu_verify(crc);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(95);

	// Jump to application
	m_cmd.dfu_jump();

	// Hardware reset
	PMU::kick_watchdog();
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(50);
	GPIOPins::release_to_highz(SAT_RESET);
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	PMU::kick_watchdog();

	// Read new firmware version
	m_cmd.init();
	bool app_ready = false;
	for (uint8_t attempt = 0; attempt < 10; attempt++) {
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
		PMU::kick_watchdog();
		if (m_cmd.ping()) {
			app_ready = true;
			break;
		}
	}

