spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	if (app_ready) {
		m_new_firmware_version = get_firmware_version();
	}

	if (progress_callback) progress_callback(100);

	DEBUG_INFO("SmdSat::%s: Firmware update completed!", __func__);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update(File *file, size_t size, uint32_t stm32_crc32,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting streamed firmware update | size=%u bytes | CRC32=0x%08X",
	           __func__, (unsigned int)size, stm32_crc32);

	if (file == nullptr || size == 0) {
		return DFU_RSP_ERROR;
	}

	if (!m_cmd.dfu_supported()) {
		return DFU_RSP_ERROR;
	}

	SmdDfuResponse result;

	if (!dfu_enter()) {
		return DFU_RSP_NOT_READY;
	}

	if (progress_callback) progress_callback(5);

	SmdDfuInfo dfu_info;
	if (!m_cmd.dfu_get_bootloader_info(&dfu_info)) {
		return DFU_RSP_ERROR;
	}

	if (size > dfu_info.app_max_size) {
		return DFU_RSP_SIZE_ERROR;
	}

	if (progress_callback) progress_callback(15);

	result = m_cmd.dfu_erase();
	if (result != DFU_RSP_OK) return result;

	if (progress_callback) progress_callback(25);

	uint32_t addr = dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;
	uint8_t chunk_buf[SMDSAT_DFU_CHUNK_SIZE];

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : (uint16_t)remaining;

		PMU::kick_watchdog();

		lfs_ssize_t bytes_read = file->read(chunk_buf, chunk_size);
		if (bytes_read != (lfs_ssize_t)chunk_size) {
			return DFU_RSP_ERROR;
		}

		result = m_cmd.dfu_write_chunk(addr, chunk_buf, chunk_size);
		if (result != DFU_RSP_OK) return result;

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		if (progress_callback) {
			uint8_t progress = 25 + (uint8_t)((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

		nrf_delay_ms(5);
	}

	if (progress_callback) progress_callback(90);

	result = m_cmd.dfu_verify(stm32_crc32);
	if (result != DFU_RSP_OK) return result;

	if (progress_callback) progress_callback(95);

	m_cmd.dfu_jump();

	PMU::kick_watchdog();
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(50);
	GPIOPins::release_to_highz(SAT_RESET);
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	PMU::kick_watchdog();

	m_cmd.init();
	bool app_ready = false;
	for (uint8_t attempt = 0; attempt < 10; attempt++) {
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
		PMU::kick_watchdog();
		if (m_cmd.ping()) {
			app_ready = true;
			break;
		}
	}

	if (app_ready) {
		m_new_firmware_version = get_firmware_version();
	}

	if (progress_callback) progress_callback(100);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update_from_file(const std::string& filepath,
                                                 void (*progress_callback)(uint8_t percent)) {
	(void)filepath;
	(void)progress_callback;
	DEBUG_ERROR("SmdSat::%s: Not implemented", __func__);
	return DFU_RSP_ERROR;
}

std::string SmdSat::get_firmware_version() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::init_pin(SAT_RESET);
		GPIOPins::clear(SAT_RESET);
		nrf_delay_ms(10);
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::release_to_highz(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	m_cmd.init();

	std::string version = "";

	try {
		bool smd_ready = false;
		for (uint8_t attempt = 0; attempt < 10; attempt++) {
			nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
			if (m_cmd.ping()) {
				smd_ready = true;
				break;
			}
		}

		if (smd_ready) {
			uint8_t ver[64] = {0};
			m_cmd.read_version(ver);
			size_t len = 0;
			while (len < sizeof(ver) && ver[len] != 0 && ver[len] >= 0x20 && ver[len] < 0x7F) {
				len++;
			}
			version = std::string((char*)ver, len);
			DEBUG_INFO("SmdSat::%s: Firmware version: %s", __func__, version.c_str());
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware version", __func__);
	}

	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}

	return version;
}

std::string SmdSat::smd_spi_test() {
	return m_cmd.run_command_test();
}
